app/controllers/comments_controller.rb

SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = 2 ORDER BY microposts.created_at DESC LIMIT 1
UPDATE "microposts" SET "weight" = 3, "updated_at" = '2011-10-07 06:07:16.198825' WHERE "microposts"."id" = 4
INSERT INTO "comments" ("C_votes", "User_name", "content", "created_at", "micropost_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["C_votes", nil], ["User_name", "test"], ["content", "Love you"], ["created_at", Fri, 07 Oct 2011 05:51:51 UTC +00:00], ["micropost_id", 2], ["updated_at", Fri, 07 Oct 2011 05:51:51 UTC +00:00]]
---
     def create

        @post = Micropost.find_by_id(params[:id])
         #micropost_id = :id
        @comment = @post.comments.build(params[:comment])
         @comment.User_name = params[:User_name]
		@comment.user_id = params[:User_id]
          @post.increment(:weight)
        if @comment.save && @post.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = 2 ORDER BY microposts.created_at DESC LIMIT 1
UPDATE "microposts" SET "weight" = 2, "updated_at" = '2011-10-07 05:52:00.428446' WHERE "microposts"."id" = 2
UPDATE "comments" SET "C_votes" = 1, "updated_at" = '2011-10-07 05:52:00.438447' WHERE "comments"."id" = 1
---
     def increment

       @comment = Comment.find(params[:id])
       post = @comment.micropost_id
       @micropost = Micropost.find_by_id(post)
       @micropost.increment(:weight)
       @comment.increment(:C_votes)