app/controllers/microposts_controller.rb

  def create
    @micropost  = current_user.microposts.build(params[:micropost])

    if @micropost.save
---
INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id", "votes", "weight") VALUES (?, ?, ?, ?, ?, ?)  [["content", "First post"], ["created_at", Fri, 07 Oct 2011 05:50:36 UTC +00:00], ["updated_at", Fri, 07 Oct 2011 05:50:36 UTC +00:00], ["user_id", 1], ["votes", nil], ["weight", nil]]

  def increment
    @micropost = Micropost.find(params[:id])
    @user_id = @micropost.user_id
    vote = Vote.find(:first, :conditions => {:user_id => @micropost.user_id, :micropost_id => @micropost.id})

    if vote or @micropost.user_id == current_user.id
           flash[:failure] = "You cannot vote now"
    else
       @micropost.increment(:votes)
       @micropost.increment(:weight)
       @micropost.save
       @votes = Vote.new
       @votes.micropost_id = @micropost.id
       @votes.user_id = @micropost.user_id
       @votes.save
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."id" = ? ORDER BY microposts.created_at DESC LIMIT 1  [["id", "2"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "votes".* FROM "votes" WHERE "votes"."user_id" = 1 AND "votes"."micropost_id" = 2 LIMIT 1
UPDATE "microposts" SET "votes" = 1, "weight" = 1, "updated_at" = '2011-10-07 05:51:45.070568' WHERE "microposts"."id" = 2
INSERT INTO "votes" ("created_at", "micropost_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Fri, 07 Oct 2011 05:51:45 UTC +00:00], ["micropost_id", 2], ["updated_at", Fri, 07 Oct 2011 05:51:45 UTC +00:00], ["user_id", 1]]

  def destroy
    #@micropost.destroy
    Micropost.find(params[:id]).destroy
---
DELETE FROM "microposts" WHERE "microposts"."id" = ?  [["id", 2]]