app/controllers/users_controller.rb

SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
---
  def index
    @title = "All users"

    @users = User.paginate(:page => params[:page])

INSERT INTO "users" ("admin", "created_at", "email", "encrypted_password", "name", "salt", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
      @user = User.new(params[:user])

      respond_to do |format|
        if @user.save